

#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций



#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы //<ИмяТаблицыФормы>


// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Посчитать(Команда)
	
		
	Итерация = 0;
	Результат = НашеЧисло;
	
	Пока Результат > 1 Цикл
		Если Результат%2 > 0 Тогда
			Сообщить(Строка(Результат)+"*"+"3"+"+1"+"=");
			Результат = Результат*3+1;
			
		Иначе
			Результат = Результат/2; // TODO:
				КонецЕсли;
		Итерация = Итерация + 1;
		Сообщить(Строка(Результат)+" : "+ Строка(Итерация));
	КонецЦикла;
	
	КоличествоИтераций = Строка(Итерация);
	
КонецПроцедуры

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
